Revit 2024 API
IFCAggregate.AddValueOfType Method
 Adds an ifc object with primitive type of aggregate's item type to the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void AddValueOfType(
	string typeName
)
Visual Basic
Public Sub AddValueOfType ( _
	typeName As String _
)
Visual C++
public:
void AddValueOfType(
	String^ typeName
)
Parameters
typeName
Type: System.String
 The type name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The aggregate is not valid.
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace